var questions = [{
    title: 'Зачем используется ключевое слово var?',
    answers: [
    'Для выполнения написанного выше кода',
    'Для создания новой переменной',
    'Для вывода сообщения в отдельном окне',
    'Для вывода результатов программы на экран'
    
  ],
    correct: 1
},
  {
    title: 'Правильный вариант комментариев в javascript',
    answers: [
    '/*закомментированный текст*/',
    'верны варианты //закомментированный текст и /*закомментированный текст*/',
    '*закомментированный текст',
    '//закомментированный текст'
  ],
    correct: 1
},
  {
    title: 'Какое название переменной верное с точки зрения общепринятого в javascript стиля названия переменных?',
    answers: [
    
    'myvariable',
    'myVariable',
    'MyVariable'
  ],
    correct: 1,

} ];
console.log(questions);